cases/openfoam.org/batteryCooling/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Need to be included because the boundary files are copied after the
    // decomposition was started. Thus, the boundary conditions of any field
    // does not include special BC which are introduced when we split a mesh
    // such as processor boundary. To avoid issues, we include the basic-
    // generic boundary condition file
    #includeEtc "caseDicts/setConstraintTypes"

    // This is a group that includes the batteries and channel wall
    // We can also specify single patch definition or merge them into groups
    // and only everything with one entry
    wall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
