cases/openfoam.org/batteryCooling/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    // Need to be included because the boundary files are copied after the
    // decomposition was started. Thus, the boundary conditions of any field
    // does not include special BC which are introduced when we split a mesh
    // such as processor boundary. To avoid issues, we include the basic-
    // generic boundary condition file
    #includeEtc "caseDicts/setConstraintTypes"

    // This is a group that includes the batteries and channel wall
    // We can also specify single patch definition or merge them into groups
    // and only everything with one entry
    wall
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;

        // Area Inlet       0.032 m^2
        // Circumference    0.24  m
        // Hyd. diam.       0.533 m
        // MixingLength     0.038
        mixingLength    0.020254;
        value           uniform 200;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ************************************************************************* //
