cases/openfoam.org/batteryCooling/system/decomposeParDictHierarchical
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

/*
    Main methods are:
    1) Geometric: "simple"; "hierarchical", with ordered sorting, e.g. xyz, yxz
    2) Scotch: "scotch", when running in serial; "ptscotch", running in parallel
*/

method              hierarchical;

simpleCoeffs
{
    n               (4 2 1); // total must match numberOfSubdomains
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (2 2 2); // total must match numberOfSubdomains
    delta           0.001;
    order           xyz;
}


// ************************************************************************* //
