cases/openfoam.org/batteryCooling/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*limitp
{
    type       limitPressure;

    minFactor  0.1;
    maxFactor  2;
}
*/

limitT
{
    type        limitTemperature;
    min         295;
    max         400;
    select      all;
}


// ************************************************************************* //
